// Object: WorldRenderSettings
// ClassId: 5721
// RuntimeId: 61795
// TypeInfo: 0x0000000144EB98E0
#include "../WorldRender/WorldRenderSettingsBase.h"
#include "../Global/Boolean.h"
#include "../Global/Uint32.h"
#include "../Global/Float32.h"
#include "../Core/QualityLevel.h"
#include "../Global/Int32.h"
#include "../WorldRender/LightTileDebugLightCountMode.h"
#include "../Core/Vec4.h"
#include "../WorldRender/PostProcessAAMode.h"
#include "../Core/QualityScalableInt.h"
#include "../WorldRender/SkyRenderMode.h"
#include "../WorldRender/LensReflectionAsyncComputeMethod.h"

#pragma pack(push, 16)
namespace WorldRender {
    class WorldRenderSettings : public WorldRender::WorldRenderSettingsBase {
        Core::Vec4 OverlayColor; // 0x210
        Uint32 GenericEntityMaxVisibleEntityCount; // 0x220
        Uint32 DrawDebugGroundHeight; // 0x224
        Float32 DecalVolumeScale; // 0x228
        Uint32 MaxLensFlaresPerFrame; // 0x22C
        Core::QualityLevel LensFlaresQualityLevel; // 0x230
        Uint32 GBufferLayout; // 0x234
        Uint32 GBufferTestCount; // 0x238
        Float32 GBufferAlphaTestSimpleSmoothness; // 0x23C
        Float32 GBufferForceSmoothness; // 0x240
        Float32 GBufferForceMetalMask; // 0x244
        Float32 GBufferForceReflectance; // 0x248
        Float32 GBufferForceSpecularAlbedo; // 0x24C
        Uint32 OutdoorLightTileBatchCount; // 0x250
        Int32 OnlyLightTileIndex; // 0x254
        Uint32 EmitterSunTransmittanceMapResolution; // 0x258
        Uint32 MaxDestructionVolumeCount; // 0x25C
        Uint32 MaxDecalVolumeCount; // 0x260
        Uint32 MaxSpotAndPointLightShadowmapCount; // 0x264
        Uint32 LightTileCsAvgLightCountPerTile; // 0x268
        Float32 LightCullFrustumExpandDistance; // 0x26C
        WorldRender::LightTileDebugLightCountMode LightTileDebugLightMode; // 0x270
        Int32 LightTileDebugColorMode; // 0x274
        Uint32 DebugLightStatsLightCountHighwatermark; // 0x278
        Float32 LightLodCullScreenArea; // 0x27C
        Float32 LightLodFadeScreenArea; // 0x280
        Float32 LightLodCullDistance; // 0x284
        Float32 LightLodFadeDistance; // 0x288
        Float32 LightLodShadowCullScreenArea; // 0x28C
        Float32 LightLodShadowFadeScreenArea; // 0x290
        Float32 LightLodShadowCullDistance; // 0x294
        Float32 LightLodShadowFadeDistance; // 0x298
        Float32 LightLodReflectionMinArea; // 0x29C
        Float32 LightLodAreaScaleFactor; // 0x2A0
        Float32 LightLodDistanceScaleFactor; // 0x2A4
        Uint32 OcclusionCullingWidth; // 0x2A8
        Uint32 OcclusionCullingHeight; // 0x2AC
        Uint32 OcclusionTriangleCount; // 0x2B0
        Float32 FrustumSilhouetteCullingPadding; // 0x2B4
        Int32 SubSurfaceScatteringSampleCount; // 0x2B8
        Float32 SubsurfaceBlurPixelRadiusCullThreshold; // 0x2BC
        Int32 OnlyTileIndex; // 0x2C0
        Float32 PlanarReflectionViewScale; // 0x2C4
        Float32 PlanarReflectionConvolutionSampleClampThreshold; // 0x2C8
        Uint32 PlanarReflectionConvolutionSampleCount; // 0x2CC
        Float32 PlanarReflectionCullFOV; // 0x2D0
        Float32 PlanarReflectionFarPlane; // 0x2D4
        Uint32 DrawDebugPlanarReflectionMipLevel; // 0x2D8
        Uint32 DrawDebugPlanarReflectionMode; // 0x2DC
        Float32 ReflectionLodScale; // 0x2E0
        Uint32 OverlayBlurKernelRadius; // 0x2E4
        WorldRender::PostProcessAAMode PostProcessAntialiasingMode; // 0x2E8
        Uint32 TemporalAAJitterCount; // 0x2EC
        Float32 TemporalAADisocclusionRejectionFactor; // 0x2F0
        Float32 TemporalAAMotionSharpeningFactor; // 0x2F4
        Float32 TemporalAAResponsiveness; // 0x2F8
        Float32 TemporalAAAntiflickerStrength; // 0x2FC
        Uint32 TemporalAAQuality; // 0x300
        Float32 TemporalAAPostSharpeningAmount; // 0x304
        Uint32 DrawDebugTemporalAAAccumulationCount; // 0x308
        Uint32 DrawDebugTemporalAADebugMode; // 0x30C
        Float32 DrawDebugTemporalAAMaxDistance; // 0x310
        Uint32 DLAAJitterCount; // 0x314
        Float32 DLAAJitterScale; // 0x318
        Core::QualityLevel SkyCelestialQuality; // 0x31C
        Core::QualityScalableInt SkyCelestialMaxQuadCount; // 0x320
        WorldRender::SkyRenderMode SkyRenderMode; // 0x334
        WorldRender::LensReflectionAsyncComputeMethod LensReflectionAsyncComputeMethod; // 0x338
        Float32 InterpupillaryDistance; // 0x33C
        Int32 RaytraceBuildAsyncComputeForce; // 0x340
        Float32 RaytraceReflRayToPixelRatio; // 0x344
        Float32 RaytraceReflForceMinSmoothness; // 0x348
        Float32 RaytraceReflSsrCompareLocation; // 0x34C
        Uint32 RaytraceCullMode; // 0x350
        Float32 RaytraceCullFrustumFovY; // 0x354
        Float32 RaytraceCullRadius; // 0x358
        Float32 RaytraceCullRadiusLargeObjectScale; // 0x35C
        Float32 RaytraceCullFrustumLargeObjectScale; // 0x360
        Float32 RaytraceCullRadiusEmitters; // 0x364
        Uint32 SpotLightShadowmapResolution; // 0x368
        Uint32 SpotLightShadowmapQuality; // 0x36C
        Float32 SpotLightShadowmapPoissonFilterScale; // 0x370
        Float32 SpotLightShadowMaxAngle; // 0x374
        Float32 SpotLightShadowFadeOutRange; // 0x378
        Uint32 MaxShadowCount; // 0x37C
        Uint32 LocalLightShadowmapCachingRefreshedPerFrame; // 0x380
        Uint32 LocalLightShadowmapCachingRefreshedDuringLRV; // 0x384
        Uint32 NoOutdoorLightExtraLocalLightCacheRefreshCount; // 0x388
        Uint32 MaxPunctualLightCount; // 0x38C
        Uint32 MaxPunctualShadowLightCount; // 0x390
        Uint32 MaxAreaLightCount; // 0x394
        Uint32 MaxAreaShadowLightCount; // 0x398
        Uint32 MaxLocalReflectionVolumeCount; // 0x39C
        Uint32 MaxLocalPlanarReflectionCount; // 0x3A0
        Uint32 MaxPunctualRectangularLightCount; // 0x3A4
        Core::QualityLevel PunctualLightShadowLevel; // 0x3A8
        Core::QualityLevel AreaLightShadowLevel; // 0x3AC
        Uint32 LocalIBLMaxFaceCapture; // 0x3B0
        Uint32 LocalIBLLightingUpdateCount; // 0x3B4
        Uint32 LocalIBLRefreshDelayCount; // 0x3B8
        Float32 LocalIBLSunUpdateThreshold; // 0x3BC
        Uint32 LocalIBLShadowmapSliceCount; // 0x3C0
        Uint32 LocalIBLShadowmapResolution; // 0x3C4
        Uint32 OpaqueDispatchListSortMethod; // 0x3C8
        Uint32 OpaqueDispatchListMixKey; // 0x3CC
        Uint32 OpaqueDispatchListBatchMethod; // 0x3D0
        Uint32 OpaqueDispatchListBatchArgLow; // 0x3D4
        Uint32 OpaqueDispatchListBatchArgHigh; // 0x3D8
        Uint32 ShadowDispatchListSortMethod; // 0x3DC
        Uint32 ShadowDispatchListMixKey; // 0x3E0
        Uint32 ShadowDispatchListBatchMethod; // 0x3E4
        Uint32 ShadowDispatchListBatchArgLow; // 0x3E8
        Uint32 ShadowDispatchListBatchArgHigh; // 0x3EC
        Uint32 TransparentDispatchListSortMethod; // 0x3F0
        Uint32 TransparentDispatchListMixKey; // 0x3F4
        Uint32 TransparentDispatchListBatchMethod; // 0x3F8
        Uint32 TransparentDispatchListBatchArgLow; // 0x3FC
        Uint32 TransparentDispatchListBatchArgHigh; // 0x400
        Uint32 LocalIBLLightingUpdateDelayCount; // 0x404
        Uint32 PBRLocalIBLAcquisitionWaitFrameCount; // 0x408
        Uint32 PBRDiffuseConvolutionMipLevelOffset; // 0x40C
        Uint32 PBRSpecularConvolutionSampleCount; // 0x410
        Uint32 PBRDebugSpecularConvolutionSampleCount; // 0x414
        Uint32 LocalIBLResolution; // 0x418
        Float32 DrawDebugLocalIBLPreviewScale; // 0x41C
        Uint32 DrawDebugLocalIBLIndex; // 0x420
        Uint32 DrawDebugLocalIBLMipLevel; // 0x424
        Uint32 ContinuousLocalIBLIndex; // 0x428
        Uint32 MaxLocalPlanarReflectionTargetCount; // 0x42C
        Float32 PBRMaxIlluminanceValue; // 0x430
        Float32 DiffuseRangeSRGBMinLimitValue; // 0x434
        Float32 DiffuseRangeSRGBMinValue; // 0x438
        Float32 DiffuseRangeSRGBMaxValue; // 0x43C
        Float32 DiffuseRangeSRGBMaxLimitValue; // 0x440
        Float32 VolumetricLightCascadeBaseVoxelSize; // 0x444
        Float32 VolumetricLightCascadeVoxelSizeCascadeFactor; // 0x448
        Uint32 VolumetricLightCascadeResolution; // 0x44C
        Float32 VolumetricDensityCascadeBaseVoxelSize; // 0x450
        Float32 VolumetricDensityCascadeVoxelSizeCascadeFactor; // 0x454
        Uint32 VolumetricDensityCascadeResolution; // 0x458
        Float32 VolumetricLightingIncreaseTemporalSmoothingFactor; // 0x45C
        Float32 VolumetricLightingDecreaseTemporalSmoothingFactor; // 0x460
        Uint32 VolumetricShadowQuality; // 0x464
        Uint32 VolumetricShadowmapResolution; // 0x468
        Uint32 VolumetricShadowmapMaxCount; // 0x46C
        Core::QualityLevel PunctualLightCastVolumetricShadowmapEnableLevel; // 0x470
        Core::QualityLevel AreaLightCastVolumetricShadowmapEnableLevel; // 0x474
        Uint32 VolumetricParticlesInjectionMode; // 0x478
        Uint32 DrawDebugVolumetricDensity; // 0x47C
        Uint32 DrawDebugVolumetricLight; // 0x480
        Float32 DrawGpuHistogramHDRMinEV; // 0x484
        Float32 DrawGpuHistogramHDRMaxEV; // 0x488
        Uint32 DrawGpuHistogramBinCount; // 0x48C
        Uint32 NumberOfEntitiesPerPartition; // 0x490
        Uint32 ShadowGaussianFilterQuality; // 0x494
        Boolean TestRenderingEnable; // 0x498
        Boolean GenericEntityRendererEnable; // 0x499
        Boolean ZBufferShadowTestEnable; // 0x49A
        Boolean DecalVolumeEnable; // 0x49B
        Boolean DrawDebugDecalVolumes; // 0x49C
        Boolean DrawDebugDestructionVolumes; // 0x49D
        Boolean LensFlaresEnable; // 0x49E
        Boolean DrawDebugLensFlareOccluders; // 0x49F
        Boolean DrawDebugLensFlares; // 0x4A0
        Boolean LensFlareOcclusionEnable; // 0x4A1
        Boolean CloudShadowEnable; // 0x4A2
        Boolean OverrideDynamicAO; // 0x4A3
        Boolean DrawDebugDynamicAO; // 0x4A4
        Boolean DrawDebugRaytraceRefl; // 0x4A5
        Boolean DrawDebugRaytraceAO; // 0x4A6
        Boolean DrawDebugRaytraceDirect; // 0x4A7
        Boolean FilmicEffectsEnable; // 0x4A8
        Boolean EmissiveEnable; // 0x4A9
        Boolean GBufferClearEnable; // 0x4AA
        Boolean DxGBufferLight16BitEnable; // 0x4AB
        Boolean DxGBufferNormal16BitEnable; // 0x4AC
        Boolean DxGBufferRoughness16BitEnable; // 0x4AD
        Boolean GBufferAlphaTestSimpleEnable; // 0x4AE
        Boolean GBufferSrgbEnable; // 0x4AF
        Boolean Gen4aEsramEnable; // 0x4B0
        Boolean SpecularLightingEnable; // 0x4B1
        Boolean SkinLightingEnable; // 0x4B2
        Boolean TranslucencyLightingEnable; // 0x4B3
        Boolean TranslucencyAutoThicknessEnable; // 0x4B4
        Boolean LocalLightTranslucencyEnable; // 0x4B5
        Boolean DynamicEnvmapLightingEnable; // 0x4B6
        Boolean OutdoorLightEnable; // 0x4B7
        Boolean LightStencilMethodEnable; // 0x4B8
        Boolean LightVolumeMethodEnable; // 0x4B9
        Boolean LightVolumeDepthTestEnable; // 0x4BA
        Boolean OutdoorKeyLightEnable; // 0x4BB
        Boolean OutdoorSkyLightEnable; // 0x4BC
        Boolean OutdoorLightTilingEnable; // 0x4BD
        Boolean OutdoorLightTileRenderEnable; // 0x4BE
        Boolean OutdoorLightTileBlendEnable; // 0x4BF
        Boolean OutdoorLightTileSimpleShaderEnable; // 0x4C0
        Boolean EmitterSunTransmittanceMapEnable; // 0x4C1
        Boolean RadiositySpotLightShadowCullingEnable; // 0x4C2
        Boolean LightTileCombineOutdoorLightEnable; // 0x4C3
        Boolean LightTileCsPathEnable; // 0x4C4
        Boolean LightTileAsyncComputeCulling; // 0x4C5
        Boolean LightTileMinMaxUseHTile; // 0x4C6
        Boolean LightTileUseCullingHierarchy; // 0x4C7
        Boolean LightTileUseDetailedGpuTimers; // 0x4C8
        Boolean LightTileUseCsIndirectClears; // 0x4C9
        Boolean DrawDebugLightStats; // 0x4CA
        Boolean DrawDebugLightStatsForward; // 0x4CB
        Boolean DrawDebugLightSources; // 0x4CC
        Boolean DrawDebugLightShadowSources; // 0x4CD
        Boolean DrawDebugLightShadowStats; // 0x4CE
        Boolean DrawDebugLightCullStats; // 0x4CF
        Boolean DrawDebugGBuffer; // 0x4D0
        Boolean DrawDebugMaterialInput; // 0x4D1
        Boolean DrawDebugMaterialOutput; // 0x4D2
        Boolean DrawDebugLightEmissiveSurface; // 0x4D3
        Boolean UseNewLightCullEnable; // 0x4D4
        Boolean LightCullEnable; // 0x4D5
        Boolean LightOcclusionCullEnable; // 0x4D6
        Boolean LightConeCullEnable; // 0x4D7
        Boolean FrustumSilhouetteCullingEnable; // 0x4D8
        Boolean SubSurfaceScatteringEnable; // 0x4D9
        Boolean TranslucencyEnable; // 0x4DA
        Boolean SplitLightingEnable; // 0x4DB
        Boolean SubsurfaceBlurComputeEnable; // 0x4DC
        Boolean SubsurfaceBlurQuadtreeTileGenEnable; // 0x4DD
        Boolean OpaqueSortBySolutionEnable; // 0x4DE
        Boolean MainOpaqueZPassEnable; // 0x4DF
        Boolean PlanarReflectionEnable; // 0x4E0
        Boolean PlanarReflectionFastHdrEnable; // 0x4E1
        Boolean PlanarReflectionBlurEnable; // 0x4E2
        Boolean PlanarReflectionConvolutionEnable; // 0x4E3
        Boolean PlanarReflectionConvolutionRandomSamplesEnable; // 0x4E4
        Boolean PlanarReflectionConvolutionPostFilterEnable; // 0x4E5
        Boolean PlanarReflectionClippingEnable; // 0x4E6
        Boolean DrawDebugPlanarReflection; // 0x4E7
        Boolean DrawDebugPlanarReflectionCullFrustum; // 0x4E8
        Boolean LocalPlanarReflectionConvolutionEnable; // 0x4E9
        Boolean OverlayEnable; // 0x4EA
        Boolean OverlayZTestEnable; // 0x4EB
        Boolean OutlineEnable; // 0x4EC
        Boolean OutlineEdgeDetectEnable; // 0x4ED
        Boolean OverlayBlurEnable; // 0x4EE
        Boolean OverlayBlurAsyncComputeEnable; // 0x4EF
        Boolean SimpleVolumetricsEnable; // 0x4F0
        Boolean SimpleVolumetricsInHalfRes; // 0x4F1
        Boolean TransparentDepthZPrepassEnable; // 0x4F2
        Boolean SmaaVelocityReprojectionEnable; // 0x4F3
        Boolean SmaaUseStencil; // 0x4F4
        Boolean SmaaPredicatedThresholdingEnable; // 0x4F5
        Boolean TemporalAAJitterUseCmj; // 0x4F6
        Boolean TemporalAAHistorySharpeningEnable; // 0x4F7
        Boolean DrawDebugTemporalAAEnable; // 0x4F8
        Boolean TemporalAADofCocFilterEnable; // 0x4F9
        Boolean DLAADrawEnable; // 0x4FA
        Boolean SkyCelestialEnable; // 0x4FB
        Boolean DofBeforeMotionBlur; // 0x4FC
        Boolean LensReflectionEnable; // 0x4FD
        Boolean LensDirtEnable; // 0x4FE
        Boolean VrHmdLensDistortionEnable; // 0x4FF
        Boolean VrHmdLateReprojectionEnable; // 0x500
        Boolean RaytraceEnable; // 0x501
        Boolean RaytraceDebugEnable; // 0x502
        Boolean RaytraceForwardEnable; // 0x503
        Boolean RaytraceBuildAsyncComputeEnable; // 0x504
        Boolean RaytraceAoEnable; // 0x505
        Boolean RaytraceReflEnable; // 0x506
        Boolean RaytraceReflTransparentEnable; // 0x507
        Boolean RaytraceReflSsrCompareEnable; // 0x508
        Boolean RaytraceReflSsrCompareInvertSide; // 0x509
        Boolean RaytraceDirectEnable; // 0x50A
        Boolean SpotLightShadowmapEnable; // 0x50B
        Boolean LocalLightShadowmapCachingEnable; // 0x50C
        Boolean PBRSupportOriginalLight; // 0x50D
        Boolean RadiosityShadowCullingEnable; // 0x50E
        Boolean PunctualLightsEnable; // 0x50F
        Boolean AreaLightsEnable; // 0x510
        Boolean LocalReflectionEnable; // 0x511
        Boolean TilePassPunctualLightsEnable; // 0x512
        Boolean TilePassPunctualLightShadowEnable; // 0x513
        Boolean TilePassAreaLightsEnable; // 0x514
        Boolean TilePassAreaLightShadowEnable; // 0x515
        Boolean TilePassLocalReflectionVolumeEnable; // 0x516
        Boolean TilePassLocalPlanarReflectionEnable; // 0x517
        Boolean SphereLightsEnable; // 0x518
        Boolean PunctualSphereLightsEnable; // 0x519
        Boolean SpotLightsEnable; // 0x51A
        Boolean PunctualSpotLightsEnable; // 0x51B
        Boolean TubeLightsEnable; // 0x51C
        Boolean PunctualTubeLightsEnable; // 0x51D
        Boolean RectangularLightsEnable; // 0x51E
        Boolean PunctualRectangularLightsEnable; // 0x51F
        Boolean LocalReflectionVolumeSphereEnable; // 0x520
        Boolean LocalReflectionVolumeBoxEnable; // 0x521
        Boolean LocalPlanarReflectionEnable; // 0x522
        Boolean LocalPlanarReflectionConvolveEnable; // 0x523
        Boolean LocalIBLUpdateWithSkyEnable; // 0x524
        Boolean LocalIBLUpdateWithEnlightenSkyBoxChange; // 0x525
        Boolean LocalIBLSunSpecularOcclusionEnable; // 0x526
        Boolean LocalIBLBoxCullingEnable; // 0x527
        Boolean LocalIBLShadowmapFaceMerging; // 0x528
        Boolean LocalIBLShadowmapSeparateFrame; // 0x529
        Boolean LocalIBLUseVEShadowSettings; // 0x52A
        Boolean ShadowOptimisationEstimateEnable; // 0x52B
        Boolean LocalIBLWaitForStreamingEnable; // 0x52C
        Boolean PBRLocalIBLFogEnable; // 0x52D
        Boolean PBRDrawDiffuseReference; // 0x52E
        Boolean PBRDrawSpecularReference; // 0x52F
        Boolean PBRDrawLocalIBLReference; // 0x530
        Boolean PBRDrawDistantIBLReference; // 0x531
        Boolean PBRDrawAreaLightReference; // 0x532
        Boolean PBRConvolutionMISEnable; // 0x533
        Boolean PBRConvolutionHighestMIPEnable; // 0x534
        Boolean PBRConvolutionCubeArrayEnable; // 0x535
        Boolean PBRConvolutionChainEnable; // 0x536
        Boolean DrawDebugLocalIBLEnable; // 0x537
        Boolean DrawDebugLocalIBLStatsEnable; // 0x538
        Boolean DrawDebugLocalIBLShadowmaps; // 0x539
        Boolean DrawDebugPreIntegratedFGTexture; // 0x53A
        Boolean DrawDebugReflectionState; // 0x53B
        Boolean DrawDebugProbeMirrorEnable; // 0x53C
        Boolean DrawDebugProbeDiffuseEnable; // 0x53D
        Boolean DrawDebugProbeScreenEnable; // 0x53E
        Boolean DrawDebugProbeScreenOnRight; // 0x53F
        Boolean ContinuousLocalIBLEnable; // 0x540
        Boolean PBRConvolutionPrecomputedSampleEnable; // 0x541
        Boolean PBRConvolutionComputeEnable; // 0x542
        Boolean PBRConvolutionRandomRotationEnable; // 0x543
        Boolean DrawDebugLocalPlanarReflections; // 0x544
        Boolean LocalPlanarReflectionsBoxCullingEnable; // 0x545
        Boolean DrawDebugViewList; // 0x546
        Boolean EmitterQuadRenderingEnable; // 0x547
        Boolean EmitterMeshRenderingEnable; // 0x548
        Boolean EmitterPointLightsEnable; // 0x549
        Boolean EmitterSpotLightsEnable; // 0x54A
        Boolean ClearEmitterShadowBufferWhenShadowsDisabled; // 0x54B
        Boolean UseSSSProfileforOATS; // 0x54C
        Boolean DeterministicRenderingEnable; // 0x54D
        Boolean HdrNanInfRemovalEnable; // 0x54E
        Boolean HdrNanInfRemovalForceEnable; // 0x54F
        Boolean VolumetricRenderingEnable; // 0x550
        Boolean VolumetricCascadePositionUpdateEnable; // 0x551
        Boolean VolumetricLightingTemporalAAEnable; // 0x552
        Boolean VolumetricLightingUpsamplePreviousCascade; // 0x553
        Boolean VolumetricShadowSkipLowerMipSamples; // 0x554
        Boolean VolumetricShadowCascadeBasedQuality; // 0x555
        Boolean VolumetricShadowmapEnable; // 0x556
        Boolean VolumetricParticlesDensityInjectionEnable; // 0x557
        Boolean EmitterVolumetricLightingEnable; // 0x558
        Boolean DrawDebugVolumetricCascadedVolumesEnable; // 0x559
        Boolean DrawDebugVolumetricShadowMaps; // 0x55A
        Boolean DrawDebugVolumetricEmitterInjectingDensityEnable; // 0x55B
        Boolean LightShaftFastHdrEnable; // 0x55C
        Boolean DrawGpuHistogramEnable; // 0x55D
        Boolean DrawGpuHistogramRed; // 0x55E
        Boolean DrawGpuHistogramBlue; // 0x55F
        Boolean DrawGpuHistogramGreen; // 0x560
        Boolean DrawGpuHistogramLuminance; // 0x561
        Boolean DrawGpuHistogramHDRMode; // 0x562
        Boolean EntityRendererPartitioningEnable; // 0x563
        Boolean DrawDebugEntityRendererPartitions; // 0x564
        Boolean DisableNonCubemapRootViews; // 0x565
        Boolean AvoidResourceCreation; // 0x566
        Boolean AllowDeferredResourceCreation; // 0x567
        Boolean UseNvOptimisedLightCulling; // 0x568
        Boolean GpuKill; // 0x569
        char pad_0x56A[0x6];
    }; // 0x570
    static_assert(sizeof(WorldRenderSettings) == 0x570);
}
#pragma pack(pop)